In [1]:
import numpy as np
import numpy.random as random
import scipy as sp
from pandas import Series, DataFrame
import pandas as pd

import matplotlib.pyplot as plt
import matplotlib as mpl
import seaborn as sns
%matplotlib inline

%precision 3

'%.3f'

In [2]:
hq_data = pd.read_csv('hq_data/hq_20190308.csv')
hq_data.head()

                       billboard_id  as_one_id  as_two_id  as_three_id  count
0  e2c9ff98f0aec63ccd07fd97f286b1d5       46.0       61.0        758.0   2446
1  e2c9ff98f0aec63ccd07fd97f286b1d5       45.0       61.0         96.0   7855
2  2ad0b93a74dd30436e53a62406093ecb       45.0       60.0        751.0    158
3  2f6aa4efcb6beee6b62a021e5c55a5d5       43.0       61.0         65.0    262
4  ce162c7701657192334b1c0f0a236120       44.0       61.0          1.0     16

In [23]:
audience_ids = ['44', '61', '748']
billboard_id1 = '05cc093be9bc7d7a4c491972e235231b' # high
# billboard_id1 = 'dbb561c792f78028f262e88ce95f857c' # high
# billboard_id2 = '50158cf1c6fded24e3b510d0d6dbd8e3' # low
billboard_id2 = '97ee222e0687d37626b2989266640d94' # low
# billboard_id2 = '03c393dbf2ae41661307a19457ea2e89' # low
# billboard_id2 = '42c5508521fdd113e63172ccd256b74e' # low
# billboard_id2 = '6943fd9adccae67d803b28dd8e33a0b3' # low

In [24]:
hq_data.dtypes

billboard_id     object
as_one_id       float64
as_two_id       float64
as_three_id     float64
count             int64
dtype: object

In [35]:
hq_data_sub = hq_data[(hq_data['billboard_id'] == billboard_id1) | (hq_data['billboard_id'] == billboard_id2)]
hq_data_sub.head()

,billboard_id,as_one_id,as_two_id,as_three_id,count
4934,05cc093be9bc7d7a4c491972e235231b,45.0,60.0,57.0,2924
13829,05cc093be9bc7d7a4c491972e235231b,45.0,60.0,83.0,393
38601,05cc093be9bc7d7a4c491972e235231b,46.0,60.0,751.0,820
101435,05cc093be9bc7d7a4c491972e235231b,45.0,60.0,68.0,1357
108610,05cc093be9bc7d7a4c491972e235231b,46.0,60.0,828.0,502

In [36]:
hq_data_sub = hq_data_sub[(hq_data_sub['as_one_id'] == 44.0) & 
                                                    (hq_data_sub['as_two_id'] == 61.0) & 
                                                    (hq_data_sub['as_three_id'] == 748.0)]
hq_data_sub.head()

,billboard_id,as_one_id,as_two_id,as_three_id,count
130953482,05cc093be9bc7d7a4c491972e235231b,44.0,61.0,748.0,32
270419688,97ee222e0687d37626b2989266640d94,44.0,61.0,748.0,4

In [37]:
hq_data_sub[hq_data_sub['billboard_id'] == billboard_id2]

,billboard_id,as_one_id,as_two_id,as_three_id,count
270419688,97ee222e0687d37626b2989266640d94,44.0,61.0,748.0,4

In [38]:
hq_data_sub.to_csv('data/hq_counts.csv')

In [39]:
# Get the max count for the given set of audiences. 
hq_data_sub2 = hq_data[(hq_data['as_one_id'] == 44.0) & 
                                              (hq_data['as_two_id'] == 61.0) & 
                                              (hq_data['as_three_id'] == 748.0)]
hq_data_sub2.head()

,billboard_id,as_one_id,as_two_id,as_three_id,count
16320,d059faf29c3e130ea0567e909ad9cf98,44.0,61.0,748.0,13
93247,1117b8e064d09e66a22864826dac152f,44.0,61.0,748.0,90
96583,e57c19330acfb36f4c309a5be3ece4d7,44.0,61.0,748.0,1
131787,720ea8eec07356c6217da98da13634c7,44.0,61.0,748.0,60
170225,b5816a5342e7f2deff89a32f7238ccb7,44.0,61.0,748.0,78

In [40]:
max_count = hq_data_sub2['count'].max()
max_count

1208

In [43]:
new_data_s = pd.Series(['max', 0, 0, 0, max_count], index=hq_data_sub.columns)
new_data_s

billboard_id     max
as_one_id          0
as_two_id          0
as_three_id        0
count           1208
dtype: object

In [44]:
hq_data_sub_with_max = hq_data_sub.append(new_data_s, ignore_index=True)
max_count_df = hq_data_sub_with_max[hq_data_sub_with_max['billboard_id'] == 'max']
max_count_df

  billboard_id  as_one_id  as_two_id  as_three_id  count
2          max        0.0        0.0          0.0   1208

In [46]:
hq_data_sub_with_max.to_csv('data/hq_counts_with_max.csv')

In [ ]:
#